Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: electric stove is connected to the electrical supply from a supplier like eskom also called the mains supply .
af: 'n elektriese stoof is verbind aan die elektriese toevoer deur 'n verskaf

source: cellphones work with electricity .
af: selfone werk met elektrisiteit .

source: how does your cellphone make use of electricity ?
af: hoe gebruik jou selfoon elektrisiteit ?

source: cellphone has a battery .
af: selfone het 'n battery .

source: what is the difference between the way we can get an electric stove and a cellphone to work ?
af: wat is die verskil tussen die maniere waarop ons 'n elektriese stoof en 'n selfoon kan kry om te werk ?

source: a cellphone works from a rechargeable battery .
af: 'n selfoon werk met 'n herlaaibare battery .

source: the stove is connected to the mains supply .
af: die stoof is verbind aan die hooftoevoer .

source: the cellphone battery is recharged from the same electrical supply as for the stove .
af: die selfoon word herlaai vanaf dieselfde toevoer as die elektriese stoof .

source: what would you say electricity is ?
af: wat sal jy s&#234; is elektrisiteit ?

source: electricity is the name given to a wide range of electrical phenomena .
af: elektrisiteit is 'n woord wat gebruik word vir 'n wye reeks elektriese verskynsels .

source: it underlies in one form or another almost everything around us .
af: dit be&#239;nvloed in een of ander vorm alles om ons .

source: it has applications in science engineering and technology .
af: dit vind toepassings in die wetenskap ingenieurswese en tegnologie .

source: it has to do with the physical phenomena associated with the presence and movement of electrically charged objects .
af: dit het te doen met die fisiese verskynsels wat met die teenwoordigheid en beweging van elektries gelaaide voorwerpe verband hou .

source: electricity includes a wide variety of well known electrical effects such as lightning static electricity electromagnetic induction and an electric current in an electric wire .
af: elektrisiteit sluit 'n wye verskeidenheid bekende elektriese verskynsels soos lightning static electricity electromagnetic induction en 'n electric current in 'n elektriese draad .

source: a simple circuit http www.youtube.com watch?v inbyua6kola
af: 'n eenvoudige stroombaan goo.gl 4erds

source: we are using electricity all the time .
af: ons gebruik elektrisiteit elke dag .

source: we need to understand what it is about and how to use it safely and correctly .
af: ons moet verstaan wat dit is en hoe om dit veilig en korrek te gebruik .

source: have you ever used a flash light torch ?
af: het jy al ooit 'n flitslig gebruik ?

source: what is it used for ?
af: waarvoor word dit gebruik ?

source: how do you get the flash light to work ?
af: wat doen jy om 'n flitslig te laat werk ?

source: let us try to get the bulb of a torch to work .
af: kom ons probeer om die gloeilamp van 'n flitslig te laat brand .

source: we want to do this without using the torch itself .
af: ons wil dit doen sonder om die flits self te gebruik .

source: in step 2 of the learning cycle learners explore how to construct a simple electric circuit by getting a light bulb to work .
af: in stap 2 van die leersiklus het leerders ontdek hoe om 'n gloeilamp te laat werk deur die bou van 'n eenvoudige stroombaan .

source: before getting the learners to do the activity do it yourself and ensure that it works with the batteries and bulbs available .
af: voordat die leerders die aktiwiteit aanpak doen dit eers self en maak seker dat dit werk met die beskikbare batterye en gloeilampe .

source: some bulbs might need a battery of more than 1.5 v .
af: sekere gloeilampe benodig dalk 'n battery van meer as 1.5 v .

source: the best would be to find bulbs that would work from 1.5 v .
af: dit sal ideaal wees om gloeilampe te kry wat met 1.5 v werk .

source: the wires could be obtained from any electrical appliance not used anymore .
af: die drade kan verkry word van enige elektriese apparaat wat nie meer in gebruik is nie .

source: if you cannot find a bulb that would work from 1.5 v then try a 9 v battery .
af: indien 'n gloeilamp wat met 1.5 v werk nie gevind kan word nie probeer dan 'n 9v battery .

source: there is a youtube video 8 9 minutes that might be helpful to teach this unit .
af: die volgende is 'n youtube video 8 9 minute wat nuttig mag wees met die onderrig van hierdie eenheid

source: electrical contact is important in all the activities that follow .
af: elektriese kontak is belangrik in al die volgende aktiwiteite .

source: if the connections or switches do not work later on ensure that there is electrical contact metal on metal at each contact point in the circuit .
af: indien die verbindings of skakelaars later nie werk nie maak seker dat daar elektriese kontak is metaal op metaal by elke punt van die stroombaan .

source: take care to indicate this to the learners as well .
af: maak seker dat dit aan die leerders duidelik gemaak word .

source: it is not important for learners to get the predictions correct !
af: dit is nie belangrik dat die leerders se voorspellings reg is nie !

source: this is part of a learning process that works towards conceptual understanding and coherence .
af: dit is deel van die leerproses wat na begrip van die konsep en verbande lei .

source: however predictions are based on some reasoning and so it is very important that they are allowed to reflect on why their predictions were incorrect .
af: nietemin voorspellings word gegrond op 'n mate van redenasie so dit is baie belangrik dat hulle toegelaat word om na te dink oor hoekom hulle voorspellings verkeerd was .

source: many learners leave the school system believing that predicting is guessing with no follow up .
af: baie leerders verlaat die skoolstelsel met die indruk dat voorspellings op raaiskote gegrond word sonder enige opvolg .

source: learners might come up with more connections that do not work rather than connections that would work .
af: leerders mag dalk met meer verbindings vorendag kom wat nie werk nie as wat werk .

source: the bulb could be put on the negative side of the battery as well to get a connection that can work .
af: die gloeilamp mag ook aan die negatiewe kant van die battery geplaas word om 'n werkende verbinding te verkry .

source: describe in words what you did to get the bulb to light .
af: beskryf in jou eie woorde wat jy gedoen het om die gloeilamp te laat brand .

source: teacher note the core objective here is to form a complete path for electricity that connects one terminal of the battery to one terminal of the light bulb and the other to the other .
af: onderwysersnota die kerndoel is om 'n geslote baan vir die elektrisiteit te vorm wat een terminaal van die battery met een terminaal van die gloeilamp verbind en ook met die oorblywende terminale .

source: describe in words what you have done to get the bulb to light in the case of using two wires .
af: beskryf wat jy gedoen het om die gloeilamp te laat brand in die geval waar jy twee drade gebruik het .

source: in step 3 of the learning cycle a discussion should follow .
af: 'n bespreking moet in stap 3 van die leersiklus volg .

source: introduce some of the vocabulary ideas and concepts .
af: van die woordeskat idees en konsepte moet bekendgestel word .

source: together with your learners you must co construct an explanation for the phenomenon under investigation why the electric circuit works or does not work .
af: jy moet saam met die leerders 'n verduideliking van die verskynsel wat ondersoek word saamstel hoekom die elektriese stroombaan werk of nie .

source: now that we have investigated different ways of making a simple circuit let's define it in more detail .
af: noudat ons die verskillende maniere ondersoek het om 'n eenvoudige stroombaan te bou kan ons dit in meer besonderhede definieer .

source: electric circuits have different components .
af: elektriese stroombane bestaan uit verskillende komponente .

source: what does 'component' mean ?
af: wat beteken die woord komponent ?

source: look up the definition for component in your dictionary and write it below .
af: soek die definisie van komponent in jou woordeboek en skryf dit hieronder neer .

source: a part or element of a larger whole especially a part of a machine or vehicle .
af: 'n onderdeel of element van 'n groter deel veral 'n onderdeel van 'n masjien of voertuig .

source: a simple electric circuit has at least three components
af: 'n eenvoudige elektriese stroombaan bestaan uit ten minste drie komponente onderdele

source: note that the diagram has an additional component a bulb holder .
af: let op dat die diagram 'n ekstra komponent bevat 'n gloeilamphouer .

source: be aware that this obscures the actual connections to the bulb .
af: wees gewaarsku dat dit die eintlike verbindings met die gloeilamp onduidelik maak of verberg .

source: do you think there is something flowing through the bulb when it lights up ?
af: dink jy daar is iets wat deur die gloeilamp vloei wanneer dit skyn ?

source: when we connect the bulb so that it lights up there is something flowing through the whole circuit .
af: wanneer ons die gloeilamp so verbind dat dit aanskakel dan is daar iets wat deur die hele stroombaan vloei .

source: when it does not light up we have not made a proper or complete pathway for electricity .
af: wanneer dit nie skyn nie het ons nie 'n korrekte of volledige baan gebou vir die elektrisiteit nie .

source: this flowing thing' is called electric current .
af: die &#8221;ding&#8221; wat vloei word 'n elektriese stroom genoem .

source: if the bulb lights up we say there is an electric current in the circuit .
af: wanneer die lig skyn s&#234; ons dat daar 'n stroom in die baan is .

source: the electric circuit is a system for transferring energy .
af: die elektriese stroombaan is 'n stelsel vir die vervoer van energie .

source: think again about the circuits that you have constructed so far .
af: dink weer aan die stroombane wat jy sover gebou het .

source: what are the conditions for the bulb to light up ?
af: wat is die vereistes vir die lig om te skyn ?

source: the circuit should have at least all three components as mentioned above .
af: die stroombaan moet ten minste al drie bogenoemde komponente bevat .

source: the circuit should be closed .
af: die stroombaan moet geslote wees .

source: the connections should provide electrical contact metal on metal .
af: die verbindings moet elektriese kontak maak metaal op metaal .

source: let us look at the torch once more
af: kom ons kyk weer na die flits .

source: a switch is used to put an electrical device on or off .
af: 'n skakelaar word gebruik om 'n elektriese toestel aan en af te skakel .

source: but how does it work ?
af: maar hoe werk dit ?

source: simulations to build simple circuits http phet.colorado.edu en simulation signal circuit and http phet.colorado.edu en simulation circuit construction kit dc
af: simulasies van eenvoudige stroombane goo.gl vimj2 en goo.gl jrgj3

source: move the paper clip onto the second thumbnail .
af: beweeg die skuifspeld tot op die tweede duimdrukker .

source: what happens ?
af: wat gebeur ?

source: the bulb lights up .
af: die gloeilamp brand .

source: move the paper clip away from the second thumbnail ?
af: beweeg die skuifspeld weg van die tweede duimdrukker af .

source: what happens now ?
af: wat gebeur nou ?

source: the bulb goes out .
af: die gloeilamp hou op om te brand .

source: explain why you think the paper clip and cardboard device can be called a switch .
af: verduidelik hoekom jy dink dat die skuifspeld en kartontoestel 'n skakelaar genoem kan word .

source: we already said that a switch is used to turn an electrical device on or off .
af: ons het alreeds genoem dat 'n skakelaar gebruik word om 'n elektriese toestel aan en af te skakel .

source: we can also say that a switch is used to close or open an electrical circuit .
af: ons het ook ges&#234; dat so 'n skakelaar gebruik word om 'n elektriese stroombaan oop of toe te maak .

source: when the switch is on the circuit is closed .
af: wanneer die skakelaar aan is is die stroombaan gesluit voltooi .

source: an electric current then exists in the circuit .
af: 'n elektriese stroom kan dan deur die baan vloei .

source: we could also say there is an unbroken electric pathway in the circuit .
af: ons kan ook s&#234; dat daar 'n ongebroke elektriese baan in die stroombaan is .

source: when the switch is off the circuit is open .
af: wanneer die skakelaar af is is die stroombaan oop .

source: in this case there is no electric current in the circuit .
af: in hierdie geval is daar nie 'n elektriese stroom wat deur die baan vloei nie .

source: the electric pathway is now broken .
af: die elektriese baan is nou gebroke onvoltooid of oop .

source: making a battery from a lemon video http www.youtube.com watch?v ay9qcdcfevi
af: hoe om 'n battery van 'n suurlemoen te maak video goo.gl yl7wr

source: name four other electrical appliances in your home that has a switch .
af: noem vier ander elektriese toestelle in jou huis wat skakelaars bevat .

source: we need to have a closer look at the components in the electric circuit .
af: ons gaan nou meer noukeurig kyk na die komponente in 'n elektriese stroombaan .

source: this will help us to understand how a circuit works .
af: dit sal ons help om te verstaan hoe 'n stroombaan werk .

source: for the following activities it is best if learners can see the actual components mentioned different batteries light bulbs etc but if that is not possible then make reference to the photos included to complete the questions .
af: in die volgende aktiwiteite is dit ideaal as die leerders die werklike komponente wat genoem word verskillende batterye gloeilampe ens. kan sien maar as dit nie moontlik is nie verwys na die foto wat ingesluit is om die vrae te voltooi .

source: this will help learners to realise that the circuits they are building in class represent bigger circuits that are all around them in their daily lives whether it is the circuit in a car or a circuit in a house or the classroom when you turn on the light .
af: dit sal leerders help om te begryp dat die stroombane wat hulle in die klas bou voorstellings is van groter stroombane wat hulle in hulle daaglikse lewens te&#235;kom; of dit nou 'n stroombaan in 'n motor 'n huis of die klaskamer is wanneer jy byvoorbeeld 'n lig aanskakel .

source: describe in words what the battery looks like .
af: beskryf hoe die battery lyk .

source: refer specifically to the ends of the battery .
af: verwys spesifiek na die punte van die battery .

source: the battery is shaped like a cylinder .
af: die vorm is soos 'n silinder .

source: one end is flat and the other end has a knob .
af: een kant is plat die ander kant het 'n knop .

source: the battery is covered in a metallic material .
af: die buitekant is van 'n metaalmateriaal gemaak .

source: look carefully to see if you can identify a positive and a negative sign on the battery .
af: kyk versigtig en kyk of jy die positiewe en negatiewe tekens op die battery kan sien .

source: which side of the battery is marked with a positive sign and which side with a negative sign ?
af: watter kant van die battery is gemerk met die positiewe teken en watter kant met die negatiewe teken ?

source: the side with the knob is the positive end and the flat side is the negative end .
af: die kant met die knop is die positief en die plat kant is die negatief .

source: for some appliances it is very important that the batteries are put correctly into a specific position .
af: vir sekere toestelle is dit belangrik dat die batterye in die regte posisie geplaas word .

source: why do you think this is the case ?
af: hoekom dink jy is dit die geval ?

source: this is because the battery is used to get an electric current in the appliance and in some appliances the electric current can only go in a specific direction through the appliance .
af: dit is omdat die battery gebruik word om 'n elektriese stroom in die toestel te maak en in sekere toestelle kan die elektriese stroom slegs in 'n spesifieke rigting deur die toestel beweeg .

source: to prevent the appliance from being damaged the battery must be inserted in the correct direction .
af: om te keer dat die toestel beskadig word moet die battery in die korrekte posisie ingesit word .

source: in 1879 just over 130 years ago thomas edison invented the first light bulb .
af: in 1879 net meer as 130 jaar gelede het thomas edison die eerste gloeilamp ontwerp .

source: think of the all the changes it has brought to our world today !
af: dink aan al die veranderinge wat dit teweeg gebring het in ons w&#234;reld !

source: the path should start at the metal casing then up one of the metal pins then through the thin wire then down the other pin to the connection point at the bottom of the bulb .
af: die pad moet by die metaalomhulsul begin dan op deur een van die metaalpenne deur die dun draad af met die ander pen na die verbindingspunt aan die onderkant van die gloeilamp .

source: the thin wire between the two metal pins .
af: die dun draad tussen die twee metaalpenne .

source: hotter than before .
af: warmer as tevore .

source: there are also other kinds of light emitters fluorescent leds halogen lamps etc .
af: daar is ook ander goed wat lig uitstraal fluoresserende ligte led's halogeenligte ens .

source: see if you can identify what type of lights are used in your classroom .
af: kyk of jy die ligte wat in die klaskamer gebruik word kan identifiseer .

source: the battery is the source of energy .
af: die battery is 'n bron van energie .

source: some of the energy is transported through the electric wires to the thin wire inside the bulb .
af: 'n deel van die energie word deur die elektriese drade vervoer na die dun draad in die gloeilamp .

source: the thin wire becomes hot and emits gives off light .
af: die dun draad word warm en straal lig uit gee lig af .

source: from the thin wire the energy dissipates to produce heat and light .
af: die energie word omgesit na hitte en lig in die dun draad .

source: so chemical energy from the battery is transferred to the bulb to provide light and heat .
af: so chemiese energie van die sel battery word oorgedra na die gloeilamp om lig en hitte te verskaf .

source: make sure the insulation has been stripped off the ends of the wire so that the metal wire is sticking out of the end of the wire .
af: maak seker dat die isoleerband verwyder word van die punte van die draad sodat die metaaldrade uitsteek by die draad se punte .

source: inside copper wire outside coloured plastic material
af: binne koperdraad buite gekleurde plastiese materiale

source: inside copper wire is an electrical conducting material .
af: binne koperdraad is 'n elektriese geleiermateriaal .

source: it allows a path for an electric current in a circuit .
af: dit verskaf 'n roete vir die elektriese stroom in 'n baan .

source: energy is transported in the copper wire from a battery to a device .
af: energie word in die koperdraad vervoer van 'n battery na 'n toestel .

source: outside coloured plastic is an electrical insulating material .
af: buite gekleurde plastiek is 'n elektriese nie geleier isoleermateriaal .

source: it prevents the transfer of energy to the environment .
af: dit verhoed die oordrag van elektrisiteit na die omgewing .

source: it is also there for safety purposes to prevent damage or shock if the electric current is large .
af: dit is ook daar vir veiligheidsdoeleindes om skade of skok te verhoed indien die elektriese stroom groot is .

source: we have already discussed and constructed a switch but a light switch in a house looks a bit different. .
af: ons het alreeds 'n skakelaar bespreek en gebou maar 'n ligskakelaar in 'n huis lyk 'n bietjie anders .

source: describe in words how you think a light switch in your house works .
af: beskryf in jou eie woorde hoe jy dink 'n huis se ligskakelaar werk .

source: hint look again how we made a switch with a paper clip .
af: leidraad kyk weer na hoe ons 'n skakelaar gemaak het met 'n skuifspeld .

source: when you flick the switch on a connection is made and the circuit is closed meaning the light bulb will light up .
af: wanneer jy die skakelaar aansit word 'n verbinding gemaak dit beteken die gloeilamp skakel aan .

source: when the switch is turned the other way off then the connection will be broken and the circuit will not transfer energy meaning the light bulb will not light up .
af: 'n geslote stroombaan word gevorm .

source: if we want to keep a record of how we constructed a specific electric circuit we can take a photo of it .
af: indien ons 'n rekord wil hou van hoe 'n spesifieke elektriese stroombaan gebou is kan ons 'n foto daarvan neem .

source: if we do not have a camera we can remember the circuit by drawing a sketch .
af: indien ons nie 'n kamera het nie kan ons die stroombaan onthou deur 'n skets te maak .

source: look at the sketch below of the circuit that you made in the activity with the paperclip switch .
af: kyk na die skets hieronder van die stroombaan wat julle gemaak het in die aktiwiteit met die skuifspeldskakelaar .

source: it takes time to draw a sketch like this .
af: dit neem baie lank om 'n skets te maak .

source: it will even take longer if we add more components to a circuit .
af: dit sal selfs langer neem indien ons meer komponente in die baan byvoeg .

source: we could have more than one bulb like in the case of all the lights in your home .
af: ons kan ook meer as een gloeilamp h&#234; soos met al die ligte in jou huis .

source: there could be also more than one switch .
af: daar kan ook meer as een skakelaar wees .

source: each light in your home has its own switch .
af: elke lig in jou huis het sy eie skakelaar .

source: all of us do not draw equally well !
af: nie almal van ons kan ewe goed teken nie !

source: to save time and to avoid bad sketches scientists came up with a way of representing the components of a circuit with special symbols .
af: om tyd te spaar en swak sketse te vermy het navorsers vorendag gekom met 'n manier om die komponente van 'n stroombaan voor te stel met spesiale simbole .

source: these symbols are used all over the world .
af: hierdie simbole word regoor die w&#234;reld gebruik .

source: it helps scientists engineers and technicians to draw or record circuits more quickly .
af: dit help navorsers ingenieurs en tegnici om stroombane vinniger te teken of op rekord te stel .

source: it also helps everybody to understand the circuit in the same way .
af: dit help ook dat almal die stroombaan op dieselfde manier verstaan .

source: the table shows the sketch and the symbol for each of the components of our circuit .
af: die tabel wys die skets en die simbool vir elke komponent van ons stroombaan .

source: switch
af: skakelaar

source: closed switch circuit closed
af: toe geslote skakelaar stroombaan toe

source: remember a battery is made up of chemical cells .
af: onthou a battery bestaan uit chemiese selle .

source: sometimes people refer to batteries as cells but in this book we will mostly use the term battery or batteries .
af: soms verwys mense na batterye as selle maar in hierdie boek gebruik ons meestal die terme battery of selle batterye

source: when we put these symbols together to represent an electric circuit we call it a circuit diagram .
af: wanneer ons hierdie simbole saamvoeg om 'n elektriese stroombaan voor te stel noem ons dit 'n stroombaandiagram .

source: draw a circuit diagram of the sketch above .
af: teken 'n stroombaandiagram van die skets hierbo.gebruik die simbole in die tabel in plaas daarvan om die komponente te teken .
